Revit 2024 API
PostPattern.StartPost Property
 Accesses the object containing properties related to the start post.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public BalusterInfo StartPost { get; }
Visual Basic
Public ReadOnly Property StartPost As BalusterInfo
	Get
Visual C++
public:
property BalusterInfo^ StartPost {
	BalusterInfo^ get ();
}
See Also
PostPattern Class
Autodesk.Revit.DB.Architecture Namespace